Tekla.Structures.Model.BoltGroup.BoltRotateSlotsEnum
The rotation of the slots (the holes).

Tekla.Structures.Model.BoltGroup.BoltRotateSlotsEnum.ROTATE_SLOTS_ODD
The slots are crossed to odd parts.

Tekla.Structures.Model.BoltGroup.BoltRotateSlotsEnum.ROTATE_SLOTS_EVEN
The slots are crossed to even parts.

Tekla.Structures.Model.BoltGroup.BoltRotateSlotsEnum.ROTATE_SLOTS_PARALLEL
The slots are rotated to be parallel.